
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры <> Неопределено Тогда
		
		//Установка текущий пользователь
		Если ТребуемыеПараметры.Найти("ТекущийПользователь") <> Неопределено Тогда
			имяПользователя = ИмяПользователя();
			пользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(имяПользователя, Истина);
			Если пользовательСсылка.Пустая() Тогда
				новыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
				новыйПользователь.Наименование = имяПользователя;
				новыйПользователь.НаименованиеПолное = имяПользователя;
				новыйПользователь.Записать();
				пользовательСсылка = новыйПользователь.Ссылка;
			КонецЕсли; 
			ПараметрыСеанса.ТекущийПользователь = пользовательСсылка;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
